/*
   Localizable.strings
   MacDependency

   Created by Konrad Windszus on 16.07.09.
   Copyright 2009 Konrad Windszus. All rights reserved.

   Simplified Chinese translation.
 */

"UNDEFINED" = "未定义";

"SYMBOL_TYPE_EXPORT" = "导出";
"SYMBOL_TYPE_IMPORT" = "导入";
"SYMBOL_TYPE_ALL" = "所有类型";
"SYMBOL_TYPE_UNKNOWN" = "未知";

"SYMBOL_KIND_ALL" = "所有种类";

"SYMBOL_KIND_C" = "C";
"SYMBOL_KIND_CXX" = "C++";
"SYMBOL_KIND_SWIFT" = "Swift";
"SYMBOL_KIND_OBJC_CLASS" = "ObjC 类";
"SYMBOL_KIND_OBJC_METACLASS" = "ObjC 元类";
"SYMBOL_KIND_OBJC_PROTOCOL" = "ObjC 协议";
"SYMBOL_KIND_OBJC_IVAR" = "ObjC 实例变量";
"SYMBOL_KIND_OBJC_OTHER" = "ObjC";
"SYMBOL_KIND_UNKNOWN" = "未知";

"FILE_TYPE_OBJECT" = "目标文件";
"FILE_TYPE_EXECUTABLE" = "可执行文件";
"FILE_TYPE_VM_SHARED_LIBRARY" = "VM 共享库文件";
"FILE_TYPE_CORE" = "Core 文件";
"FILE_TYPE_PRELOADED_EXECUTABLE" = "预加载可执行文件";
"FILE_TYPE_SHARED_LIBRARY" = "动态库";
"FILE_TYPE_DYNAMIC_LINKER" = "动态链接器";
"FILE_TYPE_BUNDLE" = "Bundle";
"FILE_TYPE_STATIC_LIBRARY" = "静态库";
"FILE_TYPE_DSYM" = "dSYM 文件";
"FILE_TYPE_KEXT_BUNDLE" = "x86-64 内核扩展 Bundle";

"DEPENDENCY_TYPE_WEAK" = "弱链接";
"DEPENDENCY_TYPE_DELAYED" = "延迟加载";
"DEPENDENCY_TYPE_NORMAL" = "常规";
"DEPENDENCY_TYPE_UPWARD" = "向上";
"FILE_KIND_EXECUTABLE" = "可执行文件";
"FILE_KIND_DYNAMIC_LIBRARY" = "动态库";
"FILE_KIND_SHARED_CACHE" = "共享缓存";
"FILE_KIND_UNKNOWN" = "未知";

"CPU_TYPE_PPC" = "Power PC";
"CPU_TYPE_I386" = "i386";
"CPU_TYPE_PPC64" = "Power PC 64 位";
"CPU_TYPE_X8664" = "X86-64";
"CPU_TYPE_ARM" = "ARM";
"CPU_TYPE_ARM64" = "ARM64";
"CPU_TYPE_ARM6432" = "ARM64-32";


"VERSION_FORMAT" = "%1$@（兼容 %2$@）";
"VERSION_FORMAT_TIMESTAMP" = "%1$@（兼容 %2$@），%3$@";

"SIZE_FORMAT" = "%1$qu KB";
"SIZE_FORMAT_ARCHITECTURE" = "%1$qu KB（架构：%2$u KB）";

"TIMESTAMP_FORMAT" = "%Y/%m/%d";

"ERR_MINIMUM_VERSION" = "依赖 %1$s 由 %2$@ 请求，要求兼容版本 %3$@，但实际只存在兼容版本 %4$@";
"ERR_MAXIMUM_VERSION" = "依赖 %1$s 由 %2$@ 链接，链接版本为 %3$@，但实际只存在更新的版本 %4$@。这只是警告，因为 dyld 不做此项检查。";
"ERR_NAME_MISMATCH" = "依赖由 %2$@ 以安装名 %1$s 请求，但只找到 ID 为 %3$s 的文件。这只是警告，因为 dyld 不做此项检查。";
"ERR_ARCHITECTURE_MISMATCH" = "在由 %2$@ 链接的依赖文件 %1$s 中找不到合适的架构";

"ERR_NO_DEMANGLER" = "找不到 c++filt，无法还原符号名（demangle）；安装 Xcode 即可使用。符号名还原已暂时禁用。";

"LOG_PREFIX_ERROR" = "错误：";
"LOG_PREFIX_WARNING" = "警告：";
"LOG_LINK_TOOLTIP" = "点击可跳转到发生该错误的依赖。";

"DEPENDENCY_STATUS" = ">%d 个依赖（%d 个不重复）";

"OBJC_COPY_DEFINITION" = "拷贝";
"OBJC_CLOSE" = "关闭";
"OBJC_CLASS_WINDOW_TITLE" = "%@ - 类定义";
"OBJC_METACLASS_WINDOW_TITLE" = "%@ - 类方法";
"OBJC_NO_DEFINITION" = "在此映像中找不到 %@ 的 Objective-C 类定义。";
"OBJC_UNSUPPORTED_SYMBOL" = "不支持的符号：%@ 不是 Objective-C 类。";
"OBJC_NO_PROVIDER" = "在此映像的依赖中找不到提供 %@ 的库。";
"OBJC_NO_EXPORT" = "提供 %@ 的库并未将其列在导出符号中。";
